# RebarMovedBarsOverlapped Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarMovedBarsOverlapped Property
BuiltInFailures..::..RebarFailures Class See Also
---
There are identical overlapping bars in the rebar set. This will result in double counting in schedules.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarMovedBarsOverlapped { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarMovedBarsOverlapped As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarMovedBarsOverlapped {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace